benchmarks/socialNetwork/openshift/scripts/benchmark-exp-logs/no-tracing-exp/tcpdump-benchmark-100-9.log
Running 1m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/user-timeline/read
  2 threads and 60 connections
  Thread calibration: mean lat.: 1.005ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.994ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     0.96ms  538.07us   1.70ms   98.67%
    Req/Sec    51.43     73.34   300.00     91.15%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.90ms
 75.000%    0.98ms
 90.000%    1.08ms
 99.000%    1.70ms
 99.900%    7.68ms
 99.990%   17.69ms
 99.999%   17.69ms
100.000%   17.69ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.758     0.000000            1         1.00
       0.822     0.100000          503         1.11
       0.842     0.200000         1004         1.25
       0.859     0.300000         1490         1.43
       0.878     0.400000         2006         1.67
       0.898     0.500000         2496         2.00
       0.908     0.550000         2729         2.22
       0.922     0.600000         2986         2.50
       0.937     0.650000         3245         2.86
       0.954     0.700000         3480         3.33
       0.975     0.750000         3729         4.00
       0.987     0.775000         3850         4.44
       0.999     0.800000         3976         5.00
       1.014     0.825000         4095         5.71
       1.030     0.850000         4216         6.67
       1.052     0.875000         4344         8.00
       1.066     0.887500         4405         8.89
       1.076     0.900000         4466        10.00
       1.094     0.912500         4528        11.43
       1.116     0.925000         4590        13.33
       1.137     0.937500         4651        16.00
       1.151     0.943750         4684        17.78
       1.168     0.950000         4713        20.00
       1.188     0.956250         4745        22.86
       1.213     0.962500         4776        26.67
       1.248     0.968750         4805        32.00
       1.272     0.971875         4820        35.56
       1.288     0.975000         4836        40.00
       1.313     0.978125         4851        45.71
       1.384     0.981250         4867        53.33
       1.438     0.984375         4882        64.00
       1.474     0.985938         4890        71.11
       1.556     0.987500         4898        80.00
       1.630     0.989062         4905        91.43
       1.858     0.990625         4913       106.67
       1.972     0.992188         4921       128.00
       2.227     0.992969         4925       142.22
       2.445     0.993750         4929       160.00
       2.725     0.994531         4932       182.86
       3.239     0.995313         4936       213.33
       4.175     0.996094         4940       256.00
       4.227     0.996484         4942       284.44
       4.739     0.996875         4944       320.00
       4.827     0.997266         4946       365.71
       5.491     0.997656         4948       426.67
       6.375     0.998047         4950       512.00
       6.827     0.998242         4951       568.89
       7.407     0.998437         4952       640.00
       7.591     0.998633         4953       731.43
       7.679     0.998828         4954       853.33
       8.115     0.999023         4955      1024.00
       8.115     0.999121         4955      1137.78
      10.007     0.999219         4956      1280.00
      10.007     0.999316         4956      1462.86
      17.231     0.999414         4957      1706.67
      17.231     0.999512         4957      2048.00
      17.231     0.999561         4957      2275.56
      17.455     0.999609         4958      2560.00
      17.455     0.999658         4958      2925.71
      17.455     0.999707         4958      3413.33
      17.455     0.999756         4958      4096.00
      17.455     0.999780         4958      4551.11
      17.695     0.999805         4959      5120.00
      17.695     1.000000         4959          inf
#[Mean    =        0.963, StdDeviation   =        0.538]
#[Max     =       17.680, Total count    =         4959]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5943 requests in 1.00m, 1.13MB read
  Socket errors: connect 0, read 0, write 0, timeout 65
Requests/sec:     99.00
Transfer/sec:     19.24KB