benchmarks/socialNetwork/openshift/scripts/benchmark-exp-logs/no-tracing-exp/tcpdump-benchmark-80-6.log
Running 1m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/user-timeline/read
  2 threads and 60 connections
  Thread calibration: mean lat.: 1.903ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.770ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.69ms    1.30ms   8.64ms   96.47%
    Req/Sec    42.08     66.70   222.00     79.56%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.45ms
 75.000%    1.58ms
 90.000%    1.77ms
 99.000%    8.64ms
 99.900%   16.53ms
 99.990%   22.86ms
 99.999%   22.86ms
100.000%   22.86ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.193     0.000000            1         1.00
       1.306     0.100000          406         1.11
       1.347     0.200000          799         1.25
       1.383     0.300000         1205         1.43
       1.417     0.400000         1589         1.67
       1.452     0.500000         1991         2.00
       1.470     0.550000         2185         2.22
       1.493     0.600000         2383         2.50
       1.519     0.650000         2580         2.86
       1.547     0.700000         2781         3.33
       1.583     0.750000         2977         4.00
       1.605     0.775000         3074         4.44
       1.627     0.800000         3173         5.00
       1.654     0.825000         3274         5.71
       1.687     0.850000         3374         6.67
       1.721     0.875000         3473         8.00
       1.748     0.887500         3521         8.89
       1.775     0.900000         3571        10.00
       1.810     0.912500         3619        11.43
       1.865     0.925000         3669        13.33
       1.959     0.937500         3719        16.00
       2.036     0.943750         3743        17.78
       2.153     0.950000         3768        20.00
       2.511     0.956250         3793        22.86
       2.851     0.962500         3818        26.67
       3.347     0.968750         3843        32.00
       3.859     0.971875         3855        35.56
       4.163     0.975000         3867        40.00
       5.023     0.978125         3880        45.71
       5.715     0.981250         3892        53.33
       6.551     0.984375         3905        64.00
       7.239     0.985938         3911        71.11
       7.671     0.987500         3917        80.00
       8.311     0.989062         3923        91.43
       8.839     0.990625         3929       106.67
       9.967     0.992188         3936       128.00
      10.215     0.992969         3939       142.22
      10.567     0.993750         3942       160.00
      10.775     0.994531         3945       182.86
      11.071     0.995313         3948       213.33
      11.895     0.996094         3951       256.00
      12.783     0.996484         3953       284.44
      12.855     0.996875         3954       320.00
      13.207     0.997266         3956       365.71
      13.359     0.997656         3957       426.67
      14.535     0.998047         3959       512.00
      14.991     0.998242         3960       568.89
      14.991     0.998437         3960       640.00
      15.591     0.998633         3961       731.43
      16.527     0.998828         3962       853.33
      19.007     0.999023         3963      1024.00
      19.007     0.999121         3963      1137.78
      19.007     0.999219         3963      1280.00
      19.487     0.999316         3964      1462.86
      19.487     0.999414         3964      1706.67
      21.023     0.999512         3965      2048.00
      21.023     0.999561         3965      2275.56
      21.023     0.999609         3965      2560.00
      21.023     0.999658         3965      2925.71
      21.023     0.999707         3965      3413.33
      22.863     0.999756         3966      4096.00
      22.863     1.000000         3966          inf
#[Mean    =        1.692, StdDeviation   =        1.302]
#[Max     =       22.848, Total count    =         3966]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4761 requests in 1.00m, 0.90MB read
  Socket errors: connect 0, read 0, write 0, timeout 118
Requests/sec:     79.30
Transfer/sec:     15.41KB